Tekla Open API Reference for Tekla Structures 2025
FacetedBrepWithNormals Methods
The FacetedBrepWithNormals type exposes the following members.
Methods
Name | Description
CheckForTwoManifold
 Gets a value indicating whether this instance is 2-manifold.
 (Inherited from FacetedBrep.)
GetInnerFace
 Gets the inner face at the specified index.
 (Inherited from FacetedBrep.)
GetInnerFaceCount
 Gets the inner face count of the outer face at the specified index.
 (Inherited from FacetedBrep.)
GetOuterFace
 Gets the outer face at the specified index.
 (Inherited from FacetedBrep.)
Top
See Also
Reference
FacetedBrepWithNormals Class
Tekla.Structures.Geometry3d Namespace